# Pandas Fundamentals

Primary source: Dr. Freeman's Introduction to Pandas

This notebook provides an introduction to the `pandas` package. In addition to borrowing from Dr. Freeman, this notebook also borrows heavily from the book *Data Science Handbook*, which was written by Jake VanderPlas and is available at https://jakevdp.github.io/PythonDataScienceHandbook/ (accessed 12/17/2019) and from the pandas documentation.

If you do not have the TOC extension, you can use the following table of contents. Clicking on any topic will advance the notebook to the associated area. Each area has a link back to this table of contents.

   
#### Disclaimer

This notebook is by no means a comprehensive resource for the `pandas` package. Also, it is important to realize that the Python language and the available packages will continue to evolve. That being said, the objects, functions, and methods described in this notebook may one day change. If changes occur, areas of this notebook that use deprecated features may cease to work and will need to be revised or omitted.

# What is Pandas?
<a id="pandas"> </a>

The `pandas` package is one of the most popular Python tools for data management and manipulation. `pandas` is built *on top* of `numpy`. Thus, much of the functionality and methods that are available in `numpy` are also available in `pandas`. 

From https://en.wikipedia.org/wiki/Pandas_(software) (accessed 1/7/2018):

>Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license. The name is derived from the term "panel data", an econometrics term for multidimensional, structured data sets. Major features of the library are:

> - DataFrame object for data manipulation with integrated indexing.
> - Tools for reading and writing data between in-memory data structures and different file formats.
> - Data alignment and integrated handling of missing data.
> - Reshaping and pivoting of data sets.
> - Label-based slicing, fancy indexing, and subsetting of large data sets.
> - Data structure column insertion and deletion.
> - Group by engine allowing split-apply-combine operations on data sets.
> - Data set merging and joining.
> - Hierarchical axis indexing to work with high-dimensional data in a lower-dimensional data structure.
> - Time series-functionality: Date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging.
> The library is highly optimized for performance, with critical code paths written in Cython or C.

The following code block uses the *import - as* approach to import Pandas. The alias *pd* is a standard convention. We also import NumPy.

In [1]:
import pandas as pd
import numpy as np

# Pandas Objects
<a id="Pandas_Objects"> </a>

Pandas objects can be thought of as enhanced NumPy arrays. The two main Pandas objects are:
1. The Pandas `Series`, which is a one-dimensional array of indexed data. Accessing a single column of a DataFrame results in a `Series` object.
2. The Pandas `DataFrame`, which is two-dimensional array of indexed data. A `DataFrame` is a container for multiple series objects. 

The fact that Pandas objects are indexed allows us to lookup and access values by the index. Also, in contrast to NumPy arrays which are for storing numeric data, Pandas objects can store pretty much any Python data type.

## Pandas `Series` Object
To demonstrate the Pandas `Series` object, suppose we have the following 24 data points for sales over a 24 month period stored in a list object named `sales`. Also, we have a list object named `month` that stores the month that the sales occured in using the date format YYYY-MM.

In [2]:
month = ['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
         '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
         '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31',
         '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
         '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
         '2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31']

sales = [872, 873, 990, 1129, 969, 964, 1148, 614, 1068, 1138, 1057,  748,
         1255, 1016, 1058, 1064, 1229, 1060, 1144, 1119, 1188,  817,  638, 1205]

Similar capabilities are found in NumPy (remember that Pandas is based on NumPy), but in many cases you may find NumPy limitations to be cumbersome. For example, it would be much easier to use the months AS the index rather than be limited to the integer index provided by NumPy.

In [3]:
# What type of object is month? sales?
sales_data = [month, sales]
np_sales = np.array(sales_data)
print(np_sales.shape)

# If you want sales (row 1) for April, 2015 you have to know which column is April (column 3)
print(np_sales)
print("April 2015 sales: ",np_sales[1,3])

# If you want to format it for currency, you can use the format method
print("April 2015 sales: ${:0,.2f}".format(float(np_sales[1,3])).replace('$-','-$'))

(2, 24)
[['2015-01-31' '2015-02-28' '2015-03-31' '2015-04-30' '2015-05-31'
  '2015-06-30' '2015-07-31' '2015-08-31' '2015-09-30' '2015-10-31'
  '2015-11-30' '2015-12-31' '2016-01-31' '2016-02-29' '2016-03-31'
  '2016-04-30' '2016-05-31' '2016-06-30' '2016-07-31' '2016-08-31'
  '2016-09-30' '2016-10-31' '2016-11-30' '2016-12-31']
 ['872' '873' '990' '1129' '969' '964' '1148' '614' '1068' '1138' '1057'
  '748' '1255' '1016' '1058' '1064' '1229' '1060' '1144' '1119' '1188'
  '817' '638' '1205']]
April 2015 sales:  1129
April 2015 sales: $1,129.00

The following code block uses the two lists to create a Pandas `Series` that is stored in a variable named `sales_series`.

In [4]:
sales_series = pd.Series(sales, index = month)

print(f'The sales_series series is\n{sales_series}')

The sales_series series is
2015-01-31     872
2015-02-28     873
2015-03-31     990
2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
2016-01-31    1255
2016-02-29    1016
2016-03-31    1058
2016-04-30    1064
2016-05-31    1229
2016-06-30    1060
2016-07-31    1144
2016-08-31    1119
2016-09-30    1188
2016-10-31     817
2016-11-30     638
2016-12-31    1205
dtype: int64

The following code block shows how we can access individual values, or a range of values, in the series.

In [5]:
# Get the sales for April 2015
print("April sales:", sales_series['2015-04-30'])

April sales: 1129

In [6]:
# Get the sales for April 2015 through December 2015 
sales_series['2015-04-30':'2015-12-31']

2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
dtype: int64

Using NumPy-like syntax, we can do computations on `Series` objects. The following code blocks provides examples.

[Back to Table of Contents](#Table_of_Contents)<br>

In [7]:
# Compute the total sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].sum()

6737

In [8]:
# Compute the mean sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].mean()

962.4285714285714

In [9]:
# Compute the maximum sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].max()

1148

## Pandas `DataFrame` Object

We will now look at Pandas `DataFrame` object.

In [10]:
# Use the date_range function to populate a dataframe with a certain number of periods
dates = pd.date_range('20200101', periods=12)
print(dates)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# Fill the DataFrame with random numbers and assign them to columns (A, B, C, D)
df_random = pd.DataFrame(np.random.randn(12, 4), index=dates, columns=list('ABCD'))
df_random.head(12)

                   A         B         C         D
2020-01-01 -0.059633  1.052986 -1.742357  1.059898
2020-01-02 -0.499276 -0.820071  0.092236  0.892861
2020-01-03 -0.086852  1.316423 -0.594777  1.098387
2020-01-04 -1.216015  0.428146 -1.891101 -0.263607
2020-01-05 -0.466698 -0.231437 -0.013597 -1.322596
2020-01-06  0.759114 -1.349488  0.170909 -1.533044
2020-01-07 -0.608623  0.548549 -0.512186 -0.909854
2020-01-08  0.119754  1.877741 -0.015032 -1.794601
2020-01-09 -0.070267  0.717943  0.436624  1.397236
2020-01-10  0.709264  0.131167 -0.676040 -0.473675
2020-01-11  0.336716  0.759437  0.473029  1.015670
2020-01-12  2.441146  0.539476 -0.351068  1.475919

In [12]:
# Display a basic description of your DataFrame
df_random.describe()

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean    0.113219   0.414239  -0.385280   0.053550
std     0.921690   0.891392   0.767504   1.232019
min    -1.216015  -1.349488  -1.891101  -1.794601
25%    -0.474843   0.040516  -0.615093  -1.013039
50%    -0.064950   0.544012  -0.183050   0.314627
75%     0.429853   0.832824   0.111904   1.069520
max     2.441146   1.877741   0.473029   1.475919

In [13]:
float('1.22')

1.22

In [14]:
# Sort the DataFrame by values
df_random.sort_values(by='B')

                   A         B         C         D
2020-01-06  0.759114 -1.349488  0.170909 -1.533044
2020-01-02 -0.499276 -0.820071  0.092236  0.892861
2020-01-05 -0.466698 -0.231437 -0.013597 -1.322596
2020-01-10  0.709264  0.131167 -0.676040 -0.473675
2020-01-04 -1.216015  0.428146 -1.891101 -0.263607
2020-01-12  2.441146  0.539476 -0.351068  1.475919
2020-01-07 -0.608623  0.548549 -0.512186 -0.909854
2020-01-09 -0.070267  0.717943  0.436624  1.397236
2020-01-11  0.336716  0.759437  0.473029  1.015670
2020-01-01 -0.059633  1.052986 -1.742357  1.059898
2020-01-03 -0.086852  1.316423 -0.594777  1.098387
2020-01-08  0.119754  1.877741 -0.015032 -1.794601

In [15]:
# To display only the values, use the to_numpy() function
df_random.to_numpy()

array([[-0.05963268,  1.05298641, -1.74235695,  1.0598983 ],
       [-0.49927586, -0.82007135,  0.09223575,  0.89286119],
       [-0.08685232,  1.31642332, -0.59477748,  1.09838683],
       [-1.21601514,  0.42814586, -1.89110089, -0.26360693],
       [-0.46669811, -0.23143701, -0.0135971 , -1.32259582],
       [ 0.75911445, -1.3494883 ,  0.17090874, -1.53304407],
       [-0.60862322,  0.5485487 , -0.51218606, -0.90985371],
       [ 0.11975415,  1.87774096, -0.01503245, -1.79460079],
       [-0.07026721,  0.71794319,  0.43662375,  1.39723584],
       [ 0.70926434,  0.13116726, -0.67604043, -0.47367493],
       [ 0.33671586,  0.75943667,  0.47302904,  1.0156703 ],
       [ 2.44114551,  0.53947599, -0.35106819,  1.47591914]])

In [16]:
# The following code provides four lists that provide information on the sales of two products, A and B,
#   in three stores, W1, E1, and E2, over 10 years.

stores_list = ['W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 
               'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 
               'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 
               'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 
               'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 
               'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2']

dates_list = ['12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', 
              '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', 
              '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', 
              '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', 
              '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', 
              '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', 
              '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', 
              '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', 
              '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', 
              '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016']

product_list = ['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 
                'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 
                'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B']

sales_list = [1957, 1968, 1983, 2001, 1894, 1850, 2045, 1860, 1784, 1856, 
              1891, 1822, 1846, 1903, 1924, 1897, 1890, 1858, 1871, 1880, 
              1858, 1909, 1977, 1717, 1751, 1797, 1804, 1845, 1895, 1713, 
              1904, 1812, 1733, 1868, 1872, 1909, 2034, 1856, 1813, 1806, 
              1862, 1800, 1840, 1882, 1819, 1854, 1716, 1845, 1877, 1879, 
              1696, 1783, 1799, 1852, 1793, 1877, 1687, 1824, 1839, 1889]

The following code block first uses the list to construct a Python dictionary, uses the dictionary to define a Pandas `DataFrame` object named `sales_data`, and uses the `head()` method to print the first 10 rows of the `DataFrame`.

<div class="alert alert-block alert-info">
    <b>The <i>head()</i> function:</b> The <i>head()</i> function is a Pandas object method that prints the first five rows of a Pandas object by default. Specifying an integer argument instructs Pandas to return the specified number of rows from the beginning of the object. Similar to the <i>head()</i> method, the <i>tail()</i> method returns records from the end of a Pandas object.</div>

In [17]:
sales_dictionary = {'Store': stores_list,
                    'Product': product_list,
                    'Sales': sales_list,
                    'Year': dates_list}
# Although a dictionary is useful, it's hard to visualize and less convenient than a DataFrame
print(sales_dictionary)

{'Store': ['W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2'], 'Product': ['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B'], 'Sales': [1957, 1968, 1983, 2001, 1894, 1850, 2045, 1860, 1784, 1856, 1891, 1822, 1846, 1903, 1924, 1897, 1890, 1858, 1871, 1880, 1858, 1909, 1977, 1717, 1751, 1797, 1804, 1845, 1895, 1713, 1904, 1812, 1733, 1868, 1872, 1909, 2034, 1856, 1813, 1806, 1862, 1800, 1840, 1882, 1819, 1854, 1716, 1845, 1877, 1879, 1696, 1783, 1799, 1852, 1793, 1877, 1687, 1824, 1839, 1889], 'Year': ['12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016']}

In [18]:
sales_data = pd.DataFrame.from_dict(sales_dictionary)

sales_data.head(10)

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011
5    W1       A   1850  12/31/2012
6    W1       A   2045  12/31/2013
7    W1       A   1860  12/31/2014
8    W1       A   1784  12/31/2015
9    W1       A   1856  12/31/2016

A key thing to note is that the format of the `DataFrame` object is very similar to what you would see when working with Microsoft Excel worksheets. 

There are many other ways to create Pandas objects from scratch. However, for the sake of space, we will stop here. See https://jakevdp.github.io/PythonDataScienceHandbook/03.01-introducing-pandas-objects.html or use Google to find other examples.

# Importing Data

One of the most useful applications of Pandas is that it provides users with an easy way to import data from other sources. The following table was copied from https://pandas.pydata.org/pandas-docs/stable/io.html. Note that the hyperlinks will take you to sites descibing the different file formats or methods.

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%" />
<col width="40%" />
<col width="24%" />
<col width="24%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="http://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="http://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

The following code block shows how the `read_csv` method that is available in Pandas can be used to read a file off the internet that uses semi-colon delimiters, store it in an object named `my_data`, and use the `head()` method to print the first fives rows of the `DataFrame` object.

[Back to Table of Contents](#Table_of_Contents)<br>

In [19]:
my_data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/00409/Daily_Demand_Forecasting_Orders.csv',
           delimiter = ';')

my_data.head()

,"Week of the month (first week, second, third, fourth or fifth week",Day of the week (Monday to Friday),Non-urgent order,Urgent order,Order type A,Order type B,Order type C,Fiscal sector orders,Orders from the traffic controller sector,Banking orders (1),Banking orders (2),Banking orders (3),Target (Total orders)
0,1,4,316.307,223.270,61.543,175.586,302.448,0.000,65556,44914,188411,14793,539.577
1,1,5,128.633,96.042,38.058,56.037,130.580,0.000,40419,21399,89461,7679,224.675
2,1,6,43.651,84.375,21.826,25.125,82.461,1.386,11992,3452,21305,14947,129.412
3,2,2,171.297,127.667,41.542,113.294,162.284,18.156,49971,33703,69054,18423,317.120
4,2,3,90.532,113.526,37.679,56.618,116.220,6.459,48534,19646,16411,20257,210.517

In [20]:
# delete this
my_data

,"Week of the month (first week, second, third, fourth or fifth week",Day of the week (Monday to Friday),Non-urgent order,Urgent order,Order type A,Order type B,Order type C,Fiscal sector orders,Orders from the traffic controller sector,Banking orders (1),Banking orders (2),Banking orders (3),Target (Total orders)
0,1,4,316.307,223.270,61.543,175.586,302.448,0.000,65556,44914,188411,14793,539.577
1,1,5,128.633,96.042,38.058,56.037,130.580,0.000,40419,21399,89461,7679,224.675
2,1,6,43.651,84.375,21.826,25.125,82.461,1.386,11992,3452,21305,14947,129.412
3,2,2,171.297,127.667,41.542,113.294,162.284,18.156,49971,33703,69054,18423,317.120
4,2,3,90.532,113.526,37.679,56.618,116.220,6.459,48534,19646,16411,20257,210.517
5,2,4,110.925,96.360,30.792,50.704,125.868,79.000,52042,8773,47522,24966,207.364
6,2,5,144.124,118.919,43.304,66.371,153.368,0.000,46573,33597,48269,20973,263.043
7,2,6,119.379,113.870,38.584,85.961,124.413,15.709,35033,26278,56665,18502,248.958
8,3,2,218.856,124.381,33.973,148.274,162.044,1.054,66612,19461,103376,10458,344.291
9,3,3,146.518,101.045,36.399,43.306,168.723,865.000,58224,7742,82395,11948,248.428
10,3,4,178.433,102.793,45.706,111.036,124.678,194.000,47046,17299,108719,15560,281.420
11,3,5,145.865,91.180,43.851,66.277,133.440,6.523,66910,17768,36693,29046,243.568
12,3,6,170.566,114.412,43.339,136.434,128.405,23.200,32529,34002,78153,31949,308.178
13,4,2,220.343,141.406,46.241,120.865,196.296,1.653,34878,32905,117137,29188,363.402
14,4,3,193.768,141.854,56.519,136.709,143.644,1.250,57858,23956,101048,30134,336.872
15,4,4,122.736,124.256,56.167,78.101,112.724,0.000,52321,10046,62799,24233,246.992
16,4,5,144.051,158.408,51.660,92.272,164.948,6.421,47167,6440,91784,15973,308.880
17,4,6,105.415,108.688,47.717,71.474,113.935,19.023,42737,26020,27873,17600,233.126
18,5,2,240.660,163.720,59.135,157.681,187.564,0.000,39273,32917,155617,9203,404.380
19,1,3,131.067,166.649,90.476,80.509,127.575,844.000,60543,19141,78378,73839,298.560
20,1,4,130.129,98.927,42.904,43.962,142.383,193.000,54760,9163,29874,46992,229.249
21,1,5,123.286,103.551,47.331,72.444,116.529,9.467,48732,21196,47793,47574,236.304
22,1,6,190.816,87.629,32.077,127.358,137.739,18.729,46368,36798,92701,31098,297.174
23,2,2,266.741,141.437,58.721,139.034,211.646,1.223,58081,43333,135314,29716,409.401
24,2,3,123.143,106.083,36.017,75.813,119.205,1.809,45340,22109,55584,29803,231.035
25,2,4,148.139,85.310,35.576,79.997,123.253,5.377,59686,14188,67617,32319,238.826
26,2,5,118.552,100.417,54.401,75.613,105.584,16.629,40423,24682,47563,35314,235.598
27,2,6,146.959,95.153,37.656,59.907,144.549,0.000,50908,45733,43930,28998,242.112
28,3,2,299.770,133.375,57.810,236.248,196.732,57.645,71772,57756,159373,29160,490.790
29,3,3,151.341,131.788,43.359,89.382,156.916,6.528,53573,42638,62732,32386,289.657
30,3,4,206.206,92.160,45.555,148.718,104.186,93.000,49110,36904,126632,33237,298.459
31,3,5,170.868,131.463,45.550,120.548,157.505,21.272,42534,79556,50433,36483,323.603
32,4,3,435.304,181.149,67.884,267.342,281.227,0.000,64867,210508,177229,30514,616.453
33,4,4,235.106,110.874,70.376,154.242,121.417,55.000,23257,163452,63699,33805,346.035
34,4,5,168.179,125.119,71.068,100.544,136.033,14.347,28072,95989,50763,55445,307.645
35,4,6,172.783,77.371,64.137,109.062,80.648,3.693,46321,66498,61593,31625,253.847
36,5,2,381.768,140.041,118.178,260.632,152.134,9.135,34236,194216,136035,47601,530.944
37,5,3,221.438,111.392,51.199,124.660,157.500,529.000,39964,136119,66745,31031,333.359
38,5,4,193.957,111.859,47.002,99.892,159.462,540.000,59179,94460,54772,34616,306.356
39,1,6,275.076,121.697,109.888,131.165,175.777,20.057,37906,138536,85378,14020,416.830
40,2,2,252.298,150.708,77.388,154.863,182.936,12.181,32133,69093,169088,12516,415.187
41,2,3,165.472,102.530,46.295,96.870,124.837,0.000,48458,43112,72840,11304,268.002
42,2,4,126.030,108.055,53.366,69.150,111.987,418.000,42201,13736,70191,16710,234.503
43,2,5,112.246,106.641,47.399,77.610,109.715,15.837,35316,25876,38646,13989,234.724
44,2,6,123.302,94.315,48.081,72.826,109.157,12.447,43284,30138,52112,12632,230.064
45,3,2,187.810,167.455,59.042,130.098,168.254,2.129,37817,36445,103567,10443,357.394
46,3,3,119.863,139.383,44.809,99.072,115.365,0.000,54584,17242,59231,12543,259.246
47,3,4,127.805,114.813,39.025,110.740,94.470,1.617,33366,21103,84558,16683,244.235
48,3,5,120.629,112.703,39.600,240.922,122.085,169.275,37387,20246,63778,13886,402.607
49,3,6,130.465,105.273,57.467,88.462,109.132,19.323,27200,41713,59513,12260,255.061
50,4,2,222.282,120.324,41.418,135.189,165.999,0.000,39446,29290,154144,10811,342.606
51,4,3,150.257,116.959,34.193,115.536,118.911,1.424,51346,19782,89704,12182,268.640
52,4,4,96.494,87.294,32.653,81.576,74.372,4.813,34631,22420,49644,15390,188.601
53,4,5,89.526,99.756,51.985,51.930,98.107,12.740,31850,32150,21573,13807,202.022
54,4,6,134.425,79.084,36.748,71.353,105.408,0.000,33970,28701,65199,11023,213.509
55,5,2,158.716,158.133,59.131,92.639,165.079,0.000,32027,33282,128269,9287,316.849
56,5,3,150.784,133.069,54.224,115.746,116.442,2.559,51235,34421,87708,11354,286.412
57,5,4,193.534,109.639,58.378,142.382,102.687,274.000,28364,88404,91367,15003,303.447
58,5,5,196.555,108.395,76.763,96.478,131.709,0.000,37011,109931,50112,12957,304.950
59,5,6,192.116,121.106,107.568,121.152,103.180,18.678,27328,108072,56015,10690,331.900

# Indexing and Selecting Data

Although we have already seen some ways to access data in Pandas objects, this section will look at such methods in more detail.

## Indexing and Selecting Data in Pandas `Series` Objects

Recall the `sales_series` object that we created earlier.

In [21]:
sales_series

2015-01-31     872
2015-02-28     873
2015-03-31     990
2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
2016-01-31    1255
2016-02-29    1016
2016-03-31    1058
2016-04-30    1064
2016-05-31    1229
2016-06-30    1060
2016-07-31    1144
2016-08-31    1119
2016-09-30    1188
2016-10-31     817
2016-11-30     638
2016-12-31    1205
dtype: int64

It's interesting to note that the Pandas `Series` object acts like both a one-dimensional NumPy array and a standard Python dictionary. For example, to get index values for a `Series` object, you can use the `keys()` method as shown below.

In [22]:
sales_series.keys()

Index(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30', '2015-05-31',
       '2015-06-30', '2015-07-31', '2015-08-31', '2015-09-30', '2015-10-31',
       '2015-11-30', '2015-12-31', '2016-01-31', '2016-02-29', '2016-03-31',
       '2016-04-30', '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
       '2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31'],
      dtype='object')

We can also display its values.

In [23]:
sales_series.values

array([ 872,  873,  990, 1129,  969,  964, 1148,  614, 1068, 1138, 1057,
        748, 1255, 1016, 1058, 1064, 1229, 1060, 1144, 1119, 1188,  817,
        638, 1205], dtype=int64)

Also, as shown earlier, we can use NumPy-like slicing as is demonstrated in the following code block.

In [24]:
# Get the sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31']

2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
dtype: int64

Finally, we can use the boolean array capabilities of NumPy to get subsets of the `Series` object that satisfy a specified condition. As an example, the following code block identifies the months with sales greater than or equal to 1,000.

In [25]:
# Which months had sales greater than $1,000?
big_sales = sales_series[(sales_series >= 1000)].keys()
print(big_sales)

Index(['2015-04-30', '2015-07-31', '2015-09-30', '2015-10-31', '2015-11-30',
       '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30', '2016-05-31',
       '2016-06-30', '2016-07-31', '2016-08-31', '2016-09-30', '2016-12-31'],
      dtype='object')

## Indexing and Selecting Data in Pandas `DataFrame` Objects

We will now look at accessing data stored in a Pandas `DataFrame` object. Just as a reminder, the following code block prints the first five rows of the `sales_data` object that we created earlier.

In [26]:
sales_data.head()

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011

As shown in the following code block, we can select an entire column of the `DataFrame` object, resulting in a `Series`, by providing the column name in brackets.

In [27]:
sales_data['Sales']

0     1957
1     1968
2     1983
3     2001
4     1894
5     1850
6     2045
7     1860
8     1784
9     1856
10    1891
11    1822
12    1846
13    1903
14    1924
15    1897
16    1890
17    1858
18    1871
19    1880
20    1858
21    1909
22    1977
23    1717
24    1751
25    1797
26    1804
27    1845
28    1895
29    1713
30    1904
31    1812
32    1733
33    1868
34    1872
35    1909
36    2034
37    1856
38    1813
39    1806
40    1862
41    1800
42    1840
43    1882
44    1819
45    1854
46    1716
47    1845
48    1877
49    1879
50    1696
51    1783
52    1799
53    1852
54    1793
55    1877
56    1687
57    1824
58    1839
59    1889
Name: Sales, dtype: int64

Moreover, we can return multiple columns by providing the names of the desired columns as a list. Since we are returning multiple columns, the resulting object is a `DataFrame`.

In [28]:
sales_data[['Product','Sales']]

   Product  Sales
0        A   1957
1        A   1968
2        A   1983
3        A   2001
4        A   1894
5        A   1850
6        A   2045
7        A   1860
8        A   1784
9        A   1856
10       B   1891
11       B   1822
12       B   1846
13       B   1903
14       B   1924
15       B   1897
16       B   1890
17       B   1858
18       B   1871
19       B   1880
20       A   1858
21       A   1909
22       A   1977
23       A   1717
24       A   1751
25       A   1797
26       A   1804
27       A   1845
28       A   1895
29       A   1713
30       B   1904
31       B   1812
32       B   1733
33       B   1868
34       B   1872
35       B   1909
36       B   2034
37       B   1856
38       B   1813
39       B   1806
40       A   1862
41       A   1800
42       A   1840
43       A   1882
44       A   1819
45       A   1854
46       A   1716
47       A   1845
48       A   1877
49       A   1879
50       B   1696
51       B   1783
52       B   1799
53       B   1852
54       B   1793
55       B   1877
56       B   1687
57       B   1824
58       B   1839
59       B   1889

Similar to NumPy, we can perform calculations using entire columns.

In [29]:
(sales_data['Sales']/365).apply(lambda x: "{:.2f}".format(x))

0     5.36
1     5.39
2     5.43
3     5.48
4     5.19
5     5.07
6     5.60
7     5.10
8     4.89
9     5.08
10    5.18
11    4.99
12    5.06
13    5.21
14    5.27
15    5.20
16    5.18
17    5.09
18    5.13
19    5.15
20    5.09
21    5.23
22    5.42
23    4.70
24    4.80
25    4.92
26    4.94
27    5.05
28    5.19
29    4.69
30    5.22
31    4.96
32    4.75
33    5.12
34    5.13
35    5.23
36    5.57
37    5.08
38    4.97
39    4.95
40    5.10
41    4.93
42    5.04
43    5.16
44    4.98
45    5.08
46    4.70
47    5.05
48    5.14
49    5.15
50    4.65
51    4.88
52    4.93
53    5.07
54    4.91
55    5.14
56    4.62
57    5.00
58    5.04
59    5.18
Name: Sales, dtype: object

We can extract a subset of the available records by providing a boolean expression in brackets.

In [30]:
sales_data[sales_data['Product']=='B']

   Store Product  Sales        Year
10    W1       B   1891  12/31/2007
11    W1       B   1822  12/31/2008
12    W1       B   1846  12/31/2009
13    W1       B   1903  12/31/2010
14    W1       B   1924  12/31/2011
15    W1       B   1897  12/31/2012
16    W1       B   1890  12/31/2013
17    W1       B   1858  12/31/2014
18    W1       B   1871  12/31/2015
19    W1       B   1880  12/31/2016
30    E1       B   1904  12/31/2007
31    E1       B   1812  12/31/2008
32    E1       B   1733  12/31/2009
33    E1       B   1868  12/31/2010
34    E1       B   1872  12/31/2011
35    E1       B   1909  12/31/2012
36    E1       B   2034  12/31/2013
37    E1       B   1856  12/31/2014
38    E1       B   1813  12/31/2015
39    E1       B   1806  12/31/2016
50    E2       B   1696  12/31/2007
51    E2       B   1783  12/31/2008
52    E2       B   1799  12/31/2009
53    E2       B   1852  12/31/2010
54    E2       B   1793  12/31/2011
55    E2       B   1877  12/31/2012
56    E2       B   1687  12/31/2013
57    E2       B   1824  12/31/2014
58    E2       B   1839  12/31/2015
59    E2       B   1889  12/31/2016

In [31]:
# Viewing the data does not change the underlying dataset
sales_data.head()

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011

Being build on top of NumPy, we can create quite complicated boolean expressions to select subsets of records. The following code block shows how we can define and use multi-condition boolean expression to select records where the store is *E1* and the sales is greater than 1,850.

In [32]:
my_condition = (sales_data['Store'] == 'E1') & (sales_data['Sales'] > 1850)

sales_data[my_condition]

   Store Product  Sales        Year
20    E1       A   1858  12/31/2007
21    E1       A   1909  12/31/2008
22    E1       A   1977  12/31/2009
28    E1       A   1895  12/31/2015
30    E1       B   1904  12/31/2007
33    E1       B   1868  12/31/2010
34    E1       B   1872  12/31/2011
35    E1       B   1909  12/31/2012
36    E1       B   2034  12/31/2013
37    E1       B   1856  12/31/2014

## Using iloc to access data
Use `iloc` to access data within a DataFrame by passing a list of integers.

For example, if you want the first two rows of data pass an inner list to your DataFrame.

In [33]:
sales_data.head()

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011

In [34]:
# Use integer location (iloc) to display the first two rows--row 0 and row 1)
sales_data.iloc[[0,1]]

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008

In [35]:
# Display row index 2 and 3 and only the first (index 0) and third (index 2) columns
sales_data.iloc[[2,3],[0,2]]

  Store  Sales
2    W1   1983
3    W1   2001

## Using loc to access and change data
Using the `.loc` *indexer* method for Pandas, we can use this boolean expression to return a subset of the available columns.

In [36]:
sales_data.loc[sales_data['Product']=='B', 'Product'] = 'C'

In [37]:
my_condition = (sales_data['Store'] == 'E1') & (sales_data['Sales'] > 1850)

## The following loc expression uses the boolean expression to filter the rows,
## and then uses the list of column names to define the subset of columns to return
sales_data.loc[my_condition,['Product','Year']]

   Product        Year
20       A  12/31/2007
21       A  12/31/2008
22       A  12/31/2009
28       A  12/31/2015
30       C  12/31/2007
33       C  12/31/2010
34       C  12/31/2011
35       C  12/31/2012
36       C  12/31/2013
37       C  12/31/2014

Please see https://jakevdp.github.io/PythonDataScienceHandbook/03.02-data-indexing-and-selection.html for more discussion on indexing and selecting with Pandas objects.

# Handling Missing Data

In this section, we will look at a few capabilities built into Pandas for the purpose of handling missing data. For this demonstration, we will use a subset of the data contained in the `sales_data` object. The following code block creates and prints the data subset.

In [38]:
my_subset = sales_data.copy()
my_condition = (my_subset['Product']=='A') & (my_subset['Store']=='W1')
my_subset = my_subset[my_condition]
my_subset

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011
5    W1       A   1850  12/31/2012
6    W1       A   2045  12/31/2013
7    W1       A   1860  12/31/2014
8    W1       A   1784  12/31/2015
9    W1       A   1856  12/31/2016

## Using NaN
For the sake of demonstration, assume that we were missing sales for the years 2011 and 2014. The following code block uses the `None` value to delete these sales values from the `my_subset` object. Note that in the resulting DatafFrame, the sales values are replaced with `NaN`, which stands for __Not a Number__.

In [39]:
my_subset.loc[my_subset['Year']=='12/31/2011', 'Sales'] = None

my_subset.loc[my_subset['Year']=='12/31/2014', 'Sales'] = None

my_subset

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
4    W1       A     NaN  12/31/2011
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
7    W1       A     NaN  12/31/2014
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

## Forward Fill Values
In some situations, it may be reasonable to *forward fill* values whenever missing values are encountered. Essentially, the *forward filling* method use a preceding value in the DataFrame, and can be accomplished using the `fillna` Pandas method as shown in the following code block. **Note that this function can take an *axis* argument, specifying the direction of filling. In this case, we want to fill across the rows, or axis 0.**

In [40]:
my_subset.fillna(axis = 0, method = 'ffill')

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
4    W1       A  2001.0  12/31/2011
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
7    W1       A  2045.0  12/31/2014
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

## Back Fill Values
In contrast, it is also possible to *back fill* values, using values that follow in the DataFrame. This approach can be accomplished as shown in the following code block.

In [41]:
my_subset.fillna(axis = 0, method = 'bfill')

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
4    W1       A  1850.0  12/31/2011
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
7    W1       A  1784.0  12/31/2014
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

## Interpolate Values
Instead of forward or back filling missing values, we may also use the `interpolate` method to take the average of preceding and following values. This approach is demonstrated below.

In [42]:
my_subset.interpolate(axis = 0)

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
4    W1       A  1925.5  12/31/2011
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
7    W1       A  1914.5  12/31/2014
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

## Drop Values 
The final approach to handling missing values that we will cover is to drop the values. This can be done using the `dropna` method shown in the following code block.

In [43]:
my_subset.dropna(axis = 0)

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

We can also drop missing values by specifying a condition that the records with missing values will fail. For example, the following code block uses the condition `my_subset['Sales']>0` to effectively drop the records with missing sales values (i.e., 2011 and 2014 sales). 

[Back to Table of Contents](#Table_of_Contents)<br>

In [44]:
my_subset[my_subset['Sales']>0]

  Store Product   Sales        Year
0    W1       A  1957.0  12/31/2007
1    W1       A  1968.0  12/31/2008
2    W1       A  1983.0  12/31/2009
3    W1       A  2001.0  12/31/2010
5    W1       A  1850.0  12/31/2012
6    W1       A  2045.0  12/31/2013
8    W1       A  1784.0  12/31/2015
9    W1       A  1856.0  12/31/2016

# Working with Dates and times in Pandas
Pandas offers power and convenient featurs to handle dates and times. 

Properly read 
Filter by date time
Group date time
Plot using timeseries data

In [40]:
# Load Microsoft Store rating data

try:
    # coerce means invalid data will be set to NaN (not a number)
    df_ms = pd.read_csv('Microsoft_Store.csv', errors='coerce')
except Exception as e:
    print(e)
    
# View first 5 rows
df_ms.head()

parser_f() got an unexpected keyword argument 'errors'

,Name,Rating,No of people Rated,Category,Date,Price,DayOfWeek
0,Dynamic Reader,3.5,268,Books,2014-07-01,Free,Tuesday
1,"Chemistry, Organic Chemistry and Biochemistry-...",3.0,627,Books,2014-08-01,Free,Friday
2,BookViewer,3.5,593,Books,2016-02-29,Free,Monday
3,Brick Instructions,3.5,684,Books,2018-01-30,Free,Tuesday
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,2018-01-30,Free,Tuesday

In [41]:
# Get date and day name of BookViewer entry
# This fails because .day_name is not a method for a string. 
try:
    print(df_ms.loc[2, 'Date'])
    print(df_ms.loc[2, 'Date'].day_name())
except Exception as e:
    print(e)

2016-02-29 00:00:00
Monday

## Converting columns to DateTime
If the date/time column is in a standard format the Pandas understand, it will convert it automatically. If not, you must provide the string format for Pandas to properly interpret and convert the data. See (https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#providing-a-format-argument) for details.

In [85]:
# Convert the date string to a datetime object.

# With formatting string (unnecessary for this example because date format is recognized by Pandas)
df_ms['Date'] = pd.to_datetime(df_ms['Date'], format='%d-%m-%Y')

# No formatting string provides, so Pandas will make its best attempt at conversion.
#df_ms['Date'] = pd.to_datetime(df_ms['Date'])

In [87]:
# Get date of Bookviewer entry
# This succeeds because 'Date' was converted from a string to a datetime object 
try:
    print(df_ms.loc[2, 'Date'])
    print(df_ms.loc[2, 'Date'].day_name())
except Exception as e:
    print(e)

2016-02-29 00:00:00
Monday
<class 'pandas.core.series.Series'>

In [17]:
import pandas as pd

try:
    df_ms = pd.read_csv('Microsoft_Store.csv')
except Exception as e:
    print(e)

In [18]:
# You can also perform date/time conversions when you load a dataset
# Use the parse_dates parameter and pass the datetime columns of your dataset

df_ms = pd.read_csv('Microsoft_Store.csv', parse_dates=['Date'])
print(df_ms.loc[2, 'Date'].day_name())

Monday

## Using the `dt` class
The `dt` class on the Series object provides useful date and time features.

In [22]:
# Create a DayOfWeek column and store the named day
df_ms['DayOfWeek'] = df_ms['Date'].dt.day_name()
df_ms.head()

,Name,Rating,No of people Rated,Category,Date,Price,DayOfWeek
0,Dynamic Reader,3.5,268,Books,2014-07-01,Free,Tuesday
1,"Chemistry, Organic Chemistry and Biochemistry-...",3.0,627,Books,2014-08-01,Free,Friday
2,BookViewer,3.5,593,Books,2016-02-29,Free,Monday
3,Brick Instructions,3.5,684,Books,2018-01-30,Free,Tuesday
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,2018-01-30,Free,Tuesday

In [28]:
# Get earliest date
print('Earlist date: ;', df_ms['Date'].min())

# Get latest date
print('Latest date: ', df_ms['Date'].max())

# Get number of days between earliest and latest date
print(df_ms['Date'].max() - df_ms['Date'].min())

Earlist date: ; 2010-03-12 00:00:00
Latest date:  2020-12-06 00:00:00
3922 days 00:00:00

In [34]:
# Filter Microsoft Store records by date
# Show only records after 2018
date_filter = (df_ms['Date'] >= '2018')
df_ms.loc[date_filter]

,Name,Rating,No of people Rated,Category,Date,Price,DayOfWeek
3,Brick Instructions,3.5,684,Books,2018-01-30,Free,Tuesday
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,2018-01-30,Free,Tuesday
10,Coding Made Easy - SQL,4.0,774,Books,2018-01-30,Free,Tuesday
14,Historical Places in India,4.5,825,Books,2018-02-18,Free,Sunday
20,GRE Vocabulary Lists - Collection,4.5,224,Books,2019-02-05,Free,Tuesday
...,...,...,...,...,...,...,...
5308,Database Designer SDK,3.5,502,Developer Tools,2018-01-16,₹ 699.00,Tuesday
5313,WWWmaster,3.5,150,Developer Tools,2018-12-01,₹ 489.00,Saturday
5316,Get Color,3.0,785,Developer Tools,2019-08-08,₹ 54.50,Thursday
5317,JS King,1.0,720,Developer Tools,2018-07-19,₹ 269.00,Thursday
5319,"Dev Utils - JSON, CSV and XML",4.0,862,Developer Tools,2019-11-18,₹ 269.00,Monday

In [33]:
# Filter Microsoft Store records by date
# Show only records in 2018
date_filter = (df_ms['Date'] >= '2018') & (df_ms['Date'] < '2019')
df_ms.loc[date_filter]

,Name,Rating,No of people Rated,Category,Date,Price,DayOfWeek
3,Brick Instructions,3.5,684,Books,2018-01-30,Free,Tuesday
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,2018-01-30,Free,Tuesday
10,Coding Made Easy - SQL,4.0,774,Books,2018-01-30,Free,Tuesday
14,Historical Places in India,4.5,825,Books,2018-02-18,Free,Sunday
23,WikiMed,4.5,779,Books,2018-01-29,Free,Monday
...,...,...,...,...,...,...,...
5302,Sprite Basic 2 Programming Language,2.5,878,Developer Tools,2018-08-31,₹ 434.00,Friday
5304,SCADAvis.io Synoptic Editor,1.0,359,Developer Tools,2018-12-07,"₹ 1,099.00",Friday
5308,Database Designer SDK,3.5,502,Developer Tools,2018-01-16,₹ 699.00,Tuesday
5313,WWWmaster,3.5,150,Developer Tools,2018-12-01,₹ 489.00,Saturday
5317,JS King,1.0,720,Developer Tools,2018-07-19,₹ 269.00,Thursday

In [38]:
# Filter Microsoft Store records by date
# Show only records in December of 2018
date_filter = (df_ms['Date'] >= pd.to_datetime('2018-12-01')) & (df_ms['Date'] <= pd.to_datetime('2018-12-31'))
df_dec_2018 = df_ms.loc[date_filter]
df_dec_2018

,Name,Rating,No of people Rated,Category,Date,Price,DayOfWeek
412,My Board Game Collection,3.0,826,Books,2018-12-24,Free,Monday
598,LaParola,4.5,259,Books,2018-12-31,Free,Monday
683,Free Unlimited Proxy - Proxy Master for Telegram,3.5,151,Business,2018-12-18,Free,Tuesday
799,Bitcoin miner Guide - How to start mining bitc...,4.5,155,Business,2018-12-09,Free,Sunday
981,RFPM Converter,4.0,681,Business,2018-12-06,Free,Thursday
1136,Time Tracker By eBillity,1.5,101,Business,2018-12-04,Free,Tuesday
1145,Orders Manager,5.0,585,Business,2018-12-19,Free,Wednesday
1211,SmartCafe Professional - POS Kassensystem,5.0,740,Business,2018-12-06,Free,Thursday
1278,Python 3.8,3.5,697,Developer Tools,2018-12-18,Free,Tuesday
1283,Python 3.7,3.5,804,Developer Tools,2018-12-12,Free,Wednesday
1338,Take Webpage Screenshots Entirely - FireShot,4.5,741,Developer Tools,2018-12-10,Free,Monday
1340,Cookie-Editor,2.0,854,Developer Tools,2018-12-26,Free,Wednesday
1371,Lottie Viewer,4.5,693,Developer Tools,2018-12-13,Free,Thursday
1411,Bluetooth LE Universal Pad,5.0,445,Developer Tools,2018-12-07,Free,Friday
1629,EMGR Color Ink,5.0,724,Developer Tools,2018-12-03,Free,Monday
1667,FanKit,5.0,159,Developer Tools,2018-12-06,Free,Thursday
1686,Web Server Health Monitor,4.0,157,Developer Tools,2018-12-31,Free,Monday
1747,DVD player - TrueDVD Streamer support VLC and ...,1.5,677,Social,2018-12-17,Free,Monday
1779,AltspaceVR,4.5,562,Social,2018-12-12,Free,Wednesday
1830,TeamTalk,5.0,386,Social,2018-12-03,Free,Monday
2316,Break Reminder 10,3.0,512,Health and Fitness,2018-12-20,Free,Thursday
2888,Nail Salon Christmas - Nail Spa & Makeover Fun...,3.0,423,Kids and Family,2018-12-09,Free,Sunday
2911,Mommy's Busy Day - House Cleaning & Laundry Wa...,5.0,393,Kids and Family,2018-12-03,Free,Monday
2922,Wedding Day Planner : Makeup and Makeover Salo...,4.0,869,Kids and Family,2018-12-03,Free,Monday
3042,My Holy Rosary,5.0,964,Kids and Family,2018-12-01,Free,Saturday
3155,"The Tale Of Benjamin Bunny, by Beatrix Potter ...",4.5,917,Kids and Family,2018-12-28,Free,Friday
3232,Thermo ICE,4.5,894,Lifestyle,2018-12-19,Free,Wednesday
3425,MOT History Check,4.0,503,Lifestyle,2018-12-12,Free,Wednesday
3430,Open Vehicle Monitoring System,5.0,452,Lifestyle,2018-12-13,Free,Thursday
3479,JXCirrus Prayer Lite,4.0,685,Lifestyle,2018-12-21,Free,Friday
3540,Aries horoscope 2019 - supernatural birth chart,5.0,169,Lifestyle,2018-12-25,Free,Tuesday
3542,Aquarius Horoscope 2019 supernatural star chart,4.5,284,Lifestyle,2018-12-26,Free,Wednesday
3747,라디오와 멀티미디어(Radio and Multimedia),3.5,919,Multimedia Design,2018-12-03,Free,Monday
3870,Mp3tag,5.0,737,Music,2018-12-07,Free,Friday
3936,Whats New Course For Cubase 10,2.5,398,Music,2018-12-14,Free,Friday
4130,MIDI Player for Microsoft Edge,5.0,631,Music,2018-12-21,Free,Friday
4352,Constanta Tuner Express,4.0,166,Music,2018-12-31,Free,Monday
5272,7-zip compressor,2.5,901,Developer Tools,2018-12-11,₹ 69.00,Tuesday
5304,SCADAvis.io Synoptic Editor,1.0,359,Developer Tools,2018-12-07,"₹ 1,099.00",Friday
5313,WWWmaster,3.5,150,Developer Tools,2018-12-01,₹ 489.00,Saturday

In [39]:
# Get average item rating for December
print("Average item rating in Dec 2018: ", df_dec_2018['Rating'].mean())

# Weekly

Average item rating in Dec 2018:  3.9375

In [42]:
# Add a Quarter column and a week column using dt.to_period
data['Quarter'] = data['Date'].dt.to_period('Q')
data['WeekOfYear'] = data['Date'].dt.to_period('weekofyear')

# See https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects for more objects

NameError: name 'data' is not defined

# Grouping and Aggregating Data

In this section, we will look at how to use the `groupby` Pandas method to aggregate data that resides in a Pandas DataFrame object. Essentiall, the `groupby` method allows us to define a subset of the columns in a DataFrame to aggregate on. We can then use defined and user-specifed functions to compute aggregate statistics for the aggregated data. The following table, modified from that found at https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html, describes some of the defined aggregations.

<table>
<thead><tr>
<th>Aggregation</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>count()</code></td>
<td>Total number of items</td>
</tr>
<tr>
<td><code>first()</code>, <code>last()</code></td>
<td>First and last item</td>
</tr>
<tr>
<td><code>mean()</code>, <code>median()</code></td>
<td>Mean and median</td>
</tr>
<tr>
<td><code>min()</code>, <code>max()</code></td>
<td>Minimum and maximum</td>
</tr>
<tr>
<td><code>std()</code>, <code>var()</code></td>
<td>Standard deviation and variance</td>
</tr>
<tr>
<td><code>mad()</code></td>
<td>Mean absolute deviation</td>
</tr>
<tr>
<td><code>prod()</code></td>
<td>Product of all items</td>
</tr>
<tr>
<td><code>sum()</code></td>
<td>Sum of all items</td>
</tr>
<tr>
<td><code>unique()</code></td>
<td>Unique values</td>
</tr>
<tr>
<td><code>nunique()</code></td>
<td>Number of unique values</td>
</tr>
</tbody>
</table>

The following code block demonstrates how to use the `groupby` method to compute the total sales for each of the stores included in the DataFrame.

In [46]:
sales_data.groupby(['Store'])['Sales'].sum()

Store
E1    36873
E2    36413
W1    37980
Name: Sales, dtype: int64

In [47]:
# How would you group by product and display the total sales for each product?
sales_data.groupby(['Product'])['Sales'].sum()

Product
A    55838
C    55428
Name: Sales, dtype: int64

The following code block provides a closer look at how the `groupby` method works. Specifically, if we convert the grouped object to a list, we see that we get a list of tuples. The first value in the tuple specifies the grouping, and the second item specifies the data that belongs to the associated group.

[Back to Table of Contents](#Table_of_Contents)<br>

In [48]:
list(sales_data.groupby(['Store']))

[('E1',
     Store Product  Sales        Year
  20    E1       A   1858  12/31/2007
  21    E1       A   1909  12/31/2008
  22    E1       A   1977  12/31/2009
  23    E1       A   1717  12/31/2010
  24    E1       A   1751  12/31/2011
  25    E1       A   1797  12/31/2012
  26    E1       A   1804  12/31/2013
  27    E1       A   1845  12/31/2014
  28    E1       A   1895  12/31/2015
  29    E1       A   1713  12/31/2016
  30    E1       C   1904  12/31/2007
  31    E1       C   1812  12/31/2008
  32    E1       C   1733  12/31/2009
  33    E1       C   1868  12/31/2010
  34    E1       C   1872  12/31/2011
  35    E1       C   1909  12/31/2012
  36    E1       C   2034  12/31/2013
  37    E1       C   1856  12/31/2014
  38    E1       C   1813  12/31/2015
  39    E1       C   1806  12/31/2016),
 ('E2',
     Store Product  Sales        Year
  40    E2       A   1862  12/31/2007
  41    E2       A   1800  12/31/2008
  42    E2       A   1840  12/31/2009
  43    E2       A   1882  12/31/2010
  44    E2       A   1819  12/31/2011
  45    E2       A   1854  12/31/2012
  46    E2       A   1716  12/31/2013
  47    E2       A   1845  12/31/2014
  48    E2       A   1877  12/31/2015
  49    E2       A   1879  12/31/2016
  50    E2       C   1696  12/31/2007
  51    E2       C   1783  12/31/2008
  52    E2       C   1799  12/31/2009
  53    E2       C   1852  12/31/2010
  54    E2       C   1793  12/31/2011
  55    E2       C   1877  12/31/2012
  56    E2       C   1687  12/31/2013
  57    E2       C   1824  12/31/2014
  58    E2       C   1839  12/31/2015
  59    E2       C   1889  12/31/2016),
 ('W1',
     Store Product  Sales        Year
  0     W1       A   1957  12/31/2007
  1     W1       A   1968  12/31/2008
  2     W1       A   1983  12/31/2009
  3     W1       A   2001  12/31/2010
  4     W1       A   1894  12/31/2011
  5     W1       A   1850  12/31/2012
  6     W1       A   2045  12/31/2013
  7     W1       A   1860  12/31/2014
  8     W1       A   1784  12/31/2015
  9     W1       A   1856  12/31/2016
  10    W1       C   1891  12/31/2007
  11    W1       C   1822  12/31/2008
  12    W1       C   1846  12/31/2009
  13    W1       C   1903  12/31/2010
  14    W1       C   1924  12/31/2011
  15    W1       C   1897  12/31/2012
  16    W1       C   1890  12/31/2013
  17    W1       C   1858  12/31/2014
  18    W1       C   1871  12/31/2015
  19    W1       C   1880  12/31/2016)]

If a single column is specified for grouping, any aggregations are returned as a `Series` object. Thus, we can access the values using the indexing and selection methods for `Series` objects. For example, the following code block shows how to get the total sales for store *E1*.

In [49]:
sales_data.groupby(['Store'])['Sales'].sum()['E1']

36873

If more than one column is specified for grouping, aggregated data is again returned as a `Series` object. However, this object will utilize a *multi-level* index as shown below.

In [50]:
sales_data.groupby(['Store','Year'])['Sales'].sum()

Store  Year
E1     12/31/2007    3762
       12/31/2008    3721
       12/31/2009    3710
       12/31/2010    3585
       12/31/2011    3623
       12/31/2012    3706
       12/31/2013    3838
       12/31/2014    3701
       12/31/2015    3708
       12/31/2016    3519
E2     12/31/2007    3558
       12/31/2008    3583
       12/31/2009    3639
       12/31/2010    3734
       12/31/2011    3612
       12/31/2012    3731
       12/31/2013    3403
       12/31/2014    3669
       12/31/2015    3716
       12/31/2016    3768
W1     12/31/2007    3848
       12/31/2008    3790
       12/31/2009    3829
       12/31/2010    3904
       12/31/2011    3818
       12/31/2012    3747
       12/31/2013    3935
       12/31/2014    3718
       12/31/2015    3655
       12/31/2016    3736
Name: Sales, dtype: int64

To access the total sales for store *E1* during 2007, we first need to get the data for store *E1*, as shown below.

[Back to Table of Contents](#Table_of_Contents)<br>

In [51]:
sales_data.groupby(['Store','Year'])['Sales'].sum()['E1']

Year
12/31/2007    3762
12/31/2008    3721
12/31/2009    3710
12/31/2010    3585
12/31/2011    3623
12/31/2012    3706
12/31/2013    3838
12/31/2014    3701
12/31/2015    3708
12/31/2016    3519
Name: Sales, dtype: int64

Then, we can index into the resulting `Series` to get the 2007 sales.

[Back to Table of Contents](#Table_of_Contents)<br>

In [52]:
sales_data.groupby(['Store','Year'])['Sales'].sum()['E1']['12/31/2007']

3762

Essentially, when multiple columns are grouped on, the resulting aggregations can be accessed in a manner that is similar to a multi-level dictionary. If we would like the object returned to resemble a DataFrame instead, we can set the optional `as_index` argument to `False`. This is demonstrated below. 

[Back to Table of Contents](#Table_of_Contents)<br>

In [53]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].sum()

   Store        Year  Sales
0     E1  12/31/2007   3762
1     E1  12/31/2008   3721
2     E1  12/31/2009   3710
3     E1  12/31/2010   3585
4     E1  12/31/2011   3623
5     E1  12/31/2012   3706
6     E1  12/31/2013   3838
7     E1  12/31/2014   3701
8     E1  12/31/2015   3708
9     E1  12/31/2016   3519
10    E2  12/31/2007   3558
11    E2  12/31/2008   3583
12    E2  12/31/2009   3639
13    E2  12/31/2010   3734
14    E2  12/31/2011   3612
15    E2  12/31/2012   3731
16    E2  12/31/2013   3403
17    E2  12/31/2014   3669
18    E2  12/31/2015   3716
19    E2  12/31/2016   3768
20    W1  12/31/2007   3848
21    W1  12/31/2008   3790
22    W1  12/31/2009   3829
23    W1  12/31/2010   3904
24    W1  12/31/2011   3818
25    W1  12/31/2012   3747
26    W1  12/31/2013   3935
27    W1  12/31/2014   3718
28    W1  12/31/2015   3655
29    W1  12/31/2016   3736

In addition to grouping on several columns, we can also perform several aggregations using the `agg` method. The following code block shows an example where we group the `sales_data` object by *Store* and *Year*, and then determine the *mean*, *total*, and *maximum* sales for each grouping. 

[Back to Table of Contents](#Table_of_Contents)<br>

In [54]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'mean','sum','max'})

                    mean   sum   max
Store Year
E1    12/31/2007  1881.0  3762  1904
      12/31/2008  1860.5  3721  1909
      12/31/2009  1855.0  3710  1977
      12/31/2010  1792.5  3585  1868
      12/31/2011  1811.5  3623  1872
      12/31/2012  1853.0  3706  1909
      12/31/2013  1919.0  3838  2034
      12/31/2014  1850.5  3701  1856
      12/31/2015  1854.0  3708  1895
      12/31/2016  1759.5  3519  1806
E2    12/31/2007  1779.0  3558  1862
      12/31/2008  1791.5  3583  1800
      12/31/2009  1819.5  3639  1840
      12/31/2010  1867.0  3734  1882
      12/31/2011  1806.0  3612  1819
      12/31/2012  1865.5  3731  1877
      12/31/2013  1701.5  3403  1716
      12/31/2014  1834.5  3669  1845
      12/31/2015  1858.0  3716  1877
      12/31/2016  1884.0  3768  1889
W1    12/31/2007  1924.0  3848  1957
      12/31/2008  1895.0  3790  1968
      12/31/2009  1914.5  3829  1983
      12/31/2010  1952.0  3904  2001
      12/31/2011  1909.0  3818  1924
      12/31/2012  1873.5  3747  1897
      12/31/2013  1967.5  3935  2045
      12/31/2014  1859.0  3718  1860
      12/31/2015  1827.5  3655  1871
      12/31/2016  1868.0  3736  1880

As you can see in the previous code block, even though we specified `as_index = False`, the returned object still utilizes a multi-level index. However, by *chaining* the expression with the `reset_index()` method, we can obtain a standard DataFrame object as shown below.

[Back to Table of Contents](#Table_of_Contents)<br>

In [55]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'mean','sum','max'}).reset_index()

   Store        Year    mean   sum   max
0     E1  12/31/2007  1881.0  3762  1904
1     E1  12/31/2008  1860.5  3721  1909
2     E1  12/31/2009  1855.0  3710  1977
3     E1  12/31/2010  1792.5  3585  1868
4     E1  12/31/2011  1811.5  3623  1872
5     E1  12/31/2012  1853.0  3706  1909
6     E1  12/31/2013  1919.0  3838  2034
7     E1  12/31/2014  1850.5  3701  1856
8     E1  12/31/2015  1854.0  3708  1895
9     E1  12/31/2016  1759.5  3519  1806
10    E2  12/31/2007  1779.0  3558  1862
11    E2  12/31/2008  1791.5  3583  1800
12    E2  12/31/2009  1819.5  3639  1840
13    E2  12/31/2010  1867.0  3734  1882
14    E2  12/31/2011  1806.0  3612  1819
15    E2  12/31/2012  1865.5  3731  1877
16    E2  12/31/2013  1701.5  3403  1716
17    E2  12/31/2014  1834.5  3669  1845
18    E2  12/31/2015  1858.0  3716  1877
19    E2  12/31/2016  1884.0  3768  1889
20    W1  12/31/2007  1924.0  3848  1957
21    W1  12/31/2008  1895.0  3790  1968
22    W1  12/31/2009  1914.5  3829  1983
23    W1  12/31/2010  1952.0  3904  2001
24    W1  12/31/2011  1909.0  3818  1924
25    W1  12/31/2012  1873.5  3747  1897
26    W1  12/31/2013  1967.5  3935  2045
27    W1  12/31/2014  1859.0  3718  1860
28    W1  12/31/2015  1827.5  3655  1871
29    W1  12/31/2016  1868.0  3736  1880

We can also customize the column names as shown below.

[Back to Table of Contents](#Table_of_Contents)<br>

In [56]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'Mean Sales':'mean',
                                                                     'Total Sales':'sum',
                                                                     'Maximum Sales':'max'}).reset_index()

    index Store        Year  Mean Sales  Total Sales  Maximum Sales
0       0    E1  12/31/2007      1881.0         3762           1904
1       1    E1  12/31/2008      1860.5         3721           1909
2       2    E1  12/31/2009      1855.0         3710           1977
3       3    E1  12/31/2010      1792.5         3585           1868
4       4    E1  12/31/2011      1811.5         3623           1872
5       5    E1  12/31/2012      1853.0         3706           1909
6       6    E1  12/31/2013      1919.0         3838           2034
7       7    E1  12/31/2014      1850.5         3701           1856
8       8    E1  12/31/2015      1854.0         3708           1895
9       9    E1  12/31/2016      1759.5         3519           1806
10     10    E2  12/31/2007      1779.0         3558           1862
11     11    E2  12/31/2008      1791.5         3583           1800
12     12    E2  12/31/2009      1819.5         3639           1840
13     13    E2  12/31/2010      1867.0         3734           1882
14     14    E2  12/31/2011      1806.0         3612           1819
15     15    E2  12/31/2012      1865.5         3731           1877
16     16    E2  12/31/2013      1701.5         3403           1716
17     17    E2  12/31/2014      1834.5         3669           1845
18     18    E2  12/31/2015      1858.0         3716           1877
19     19    E2  12/31/2016      1884.0         3768           1889
20     20    W1  12/31/2007      1924.0         3848           1957
21     21    W1  12/31/2008      1895.0         3790           1968
22     22    W1  12/31/2009      1914.5         3829           1983
23     23    W1  12/31/2010      1952.0         3904           2001
24     24    W1  12/31/2011      1909.0         3818           1924
25     25    W1  12/31/2012      1873.5         3747           1897
26     26    W1  12/31/2013      1967.5         3935           2045
27     27    W1  12/31/2014      1859.0         3718           1860
28     28    W1  12/31/2015      1827.5         3655           1871
29     29    W1  12/31/2016      1868.0         3736           1880

Finally, in addition to using the defined aggregations, a user can specify custom aggregations using a *lambda function*. A *lambda function* is essentially a function without a defined name. To apply a lambda function, we use the syntax `lambda my_var: my_func(my_var)`, where `my_var` represents a variable that will be passed as an argument and `myfunc()` represents a function that receives `my_var` as an argument. In the case of our groupby object, the values belonging to each group will be passed as the variable.

The following code block shows how to use a lambda function to compute the $90^{th}$ percentile of the sales for each store, using NumPy's `percentile` method, along with the *mean*, *total*, and *maximum* sales for each store.

[Back to Table of Contents](#Table_of_Contents)<br>

In [57]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'Mean Sales':'mean',
                                                                     'Total Sales':'sum',
                                                                     'Maximum Sales':'max',
                                                                     '90% Sales': lambda x: np.percentile(x, 90)}).reset_index()

    index Store        Year  Mean Sales  Total Sales  Maximum Sales  90% Sales
0       0    E1  12/31/2007      1881.0         3762           1904     1899.4
1       1    E1  12/31/2008      1860.5         3721           1909     1899.3
2       2    E1  12/31/2009      1855.0         3710           1977     1952.6
3       3    E1  12/31/2010      1792.5         3585           1868     1852.9
4       4    E1  12/31/2011      1811.5         3623           1872     1859.9
5       5    E1  12/31/2012      1853.0         3706           1909     1897.8
6       6    E1  12/31/2013      1919.0         3838           2034     2011.0
7       7    E1  12/31/2014      1850.5         3701           1856     1854.9
8       8    E1  12/31/2015      1854.0         3708           1895     1886.8
9       9    E1  12/31/2016      1759.5         3519           1806     1796.7
10     10    E2  12/31/2007      1779.0         3558           1862     1845.4
11     11    E2  12/31/2008      1791.5         3583           1800     1798.3
12     12    E2  12/31/2009      1819.5         3639           1840     1835.9
13     13    E2  12/31/2010      1867.0         3734           1882     1879.0
14     14    E2  12/31/2011      1806.0         3612           1819     1816.4
15     15    E2  12/31/2012      1865.5         3731           1877     1874.7
16     16    E2  12/31/2013      1701.5         3403           1716     1713.1
17     17    E2  12/31/2014      1834.5         3669           1845     1842.9
18     18    E2  12/31/2015      1858.0         3716           1877     1873.2
19     19    E2  12/31/2016      1884.0         3768           1889     1888.0
20     20    W1  12/31/2007      1924.0         3848           1957     1950.4
21     21    W1  12/31/2008      1895.0         3790           1968     1953.4
22     22    W1  12/31/2009      1914.5         3829           1983     1969.3
23     23    W1  12/31/2010      1952.0         3904           2001     1991.2
24     24    W1  12/31/2011      1909.0         3818           1924     1921.0
25     25    W1  12/31/2012      1873.5         3747           1897     1892.3
26     26    W1  12/31/2013      1967.5         3935           2045     2029.5
27     27    W1  12/31/2014      1859.0         3718           1860     1859.8
28     28    W1  12/31/2015      1827.5         3655           1871     1862.3
29     29    W1  12/31/2016      1868.0         3736           1880     1877.6

It is also possible to perform different aggregations for different variables. However, it becomes quite complex to work with the returned objects. FOr more information, see https://pandas.pydata.org/pandas-docs/stable/groupby.html.

[Back to Table of Contents](#Table_of_Contents)<br>

# Pivot Tables

The previous section showed how the `groupby` functionality available in Pandas allows you to aggregate data that resides in a `DataFrame` object in a very flexible manner. However, many users are very familiar with the aggregation capabilities made available by Microsoft Excel's pivot table functionality. Noting this, the Pandas package comes with a builtin `pivot_table` method that attempts to replicate this functionality in a simple fashion.

The following code block shows how to use this function to compute the `mean` sales for each store, by year.

In [58]:
pd.pivot_table(sales_data, values = 'Sales', columns = 'Store', index = 'Year', aggfunc = 'mean')

Store           E1      E2      W1
Year
12/31/2007  1881.0  1779.0  1924.0
12/31/2008  1860.5  1791.5  1895.0
12/31/2009  1855.0  1819.5  1914.5
12/31/2010  1792.5  1867.0  1952.0
12/31/2011  1811.5  1806.0  1909.0
12/31/2012  1853.0  1865.5  1873.5
12/31/2013  1919.0  1701.5  1967.5
12/31/2014  1850.5  1834.5  1859.0
12/31/2015  1854.0  1858.0  1827.5
12/31/2016  1759.5  1884.0  1868.0

The following code block shows how to use this function to compute the total sales for each store, by year.

[Back to Table of Contents](#Table_of_Contents)<br>

In [59]:
pd.pivot_table(sales_data, values = 'Sales', columns = 'Store', index = 'Year', aggfunc = 'sum')

Store         E1    E2    W1
Year
12/31/2007  3762  3558  3848
12/31/2008  3721  3583  3790
12/31/2009  3710  3639  3829
12/31/2010  3585  3734  3904
12/31/2011  3623  3612  3818
12/31/2012  3706  3731  3747
12/31/2013  3838  3403  3935
12/31/2014  3701  3669  3718
12/31/2015  3708  3716  3655
12/31/2016  3519  3768  3736

In [60]:
sales_data['Store'].unique()

array(['W1', 'E1', 'E2'], dtype=object)

# Combining Datasets

The final thing that we consider in this notebook is how to merge DataFrame objects. In particular, let's assume that we have another DataFrame object that includes information on each of the stores. The following code block creates such an object.

In [61]:
stores_list = ['W1', 'E1', 'E2']

city_list = ['City A', 'City B', 'City C',]

state_list = ['State 1', 'State 2', 'State 2']

my_dict = {'Store': stores_list,
           'City': city_list,
           'State': state_list}

store_info = pd.DataFrame.from_dict(my_dict)

store_info

  Store    City    State
0    W1  City A  State 1
1    E1  City B  State 2
2    E2  City C  State 2

Let's assume that we want the total sales by state. To calculate this quantity, we first need to group the data in the `sales_data` object by store. This grouping is performed in the following code block, and the resulting object is stored in a new object called `grouped_data`.

In [62]:
grouped_data = sales_data.groupby('Store', as_index = False)['Sales'].sum()
grouped_data

  Store  Sales
0    E1  36873
1    E2  36413
2    W1  37980

We can now use Pandas `merge` method to merge the `grouped_data` object with the `store_info` object. Since they both have a column that is named *Store*, the method will merge on this common column. This is shown below.

In [63]:
grouped_data.merge(store_info)

  Store  Sales    City    State
0    E1  36873  City B  State 2
1    E2  36413  City C  State 2
2    W1  37980  City A  State 1

We can now *chain* the `groupby` method to the end of the merged data to obtain the total sales by store as is shown in the following code block.

In [64]:
grouped_data.merge(store_info).groupby('State', as_index = False)['Sales'].sum()

     State  Sales
0  State 1  37980
1  State 2  73286

**Note that we could have performed the merging and aggregation in a single, *chained* statement as follows.**

In [65]:
sales_data.groupby('Store', as_index = False)['Sales'].sum()\
.merge(store_info).groupby('State', as_index = False)['Sales'].sum()

     State  Sales
0  State 1  37980
1  State 2  73286

Let's now consider the case where we don't have nformation for all of the stores. The following code block creates a new version of the `store_info` object where we only have information for stores *E1* and *W1*.

In [66]:
stores_list = ['W1', 'E1', ]

city_list = ['City A', 'City B',]

state_list = ['State 1', 'State 2']

my_dict = {'Store': stores_list,
           'City': city_list,
           'State': state_list}

store_info2 = pd.DataFrame.from_dict(my_dict)

store_info2

  Store    City    State
0    W1  City A  State 1
1    E1  City B  State 2

The following code block shows the result of using the `merge` method to combine the `grouped_data` object with our new `store_info2` object. As you can see, with the default arguments, the returned object only includes records for stores included in both objects. Actually, the `method` is performing what is known as a *inner* where only records in both DataFrame objects are returned.

In [67]:
grouped_data.merge(store_info2)

  Store  Sales    City    State
0    E1  36873  City B  State 2
1    W1  37980  City A  State 1

If we wanted the object returened to include records for all stores, even if one is missing in one of the DataFrames being joined, we can specify an *outer* join using the `how` argument. This is shown in the following code block. Since he `store_info2` object does not include any information for store *E2*, we will get a `NaN` value for the *City* and *State* columns of the associated row in the returned object.

In [68]:
grouped_data.merge(store_info2, how = 'outer')

  Store  Sales    City    State
0    E1  36873  City B  State 2
1    E2  36413     NaN      NaN
2    W1  37980  City A  State 1

The Pandas package includes additional capabilities for joining DataFrame objects. For more info, see https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html.